Repository: Azure/Industrial-IoT-Edge-Installer
Catalog: Common/Strings.*.resx
Languages: de_de

# AboutSubtitle
source: Azure Industrial IoT Gateway Installer
de_de: Azure IoT Edge Installer

# Admin
source: Please restart this app as Administrator/sudo.
de_de: Bitte started Sie diese App als Administrator/sudo neu.

# AzureCLI
source: We first need to install the Azure CLI. The installer will now launch. Please reboot after the installation is complete.
de_de: Wir muessen zunaechst Azure CLI fuer Windows installieren. Der Web-Installer dafuer wird nun ausgefuehrt. Bitte starten Sie den Computer danach neu.

# AzureCreateDeviceIdDesc
source: Name your IoT Edge Device:
de_de: Geben Sie Ihrem IoT Edge Geraet einen Namen:

# Completed
source: This part of the installation is completed.
de_de: Dieser Teil der Installation ist abgeschlossen.

# ConnectToAzure_NoAzureIoTHub
source: Looks like you haven’t set up an Azure IoT Hub yet.
de_de: Es sieht so aus als haetten Sie noch keinen Azure IoT Hub angelegt.

# CreateEdgeButton
source: Install
de_de: Installieren

# CreateFailed
source: Creating IoT Edge device on selected IoT Hub failed.
de_de: Das IoT Edge Geraet konnte nicht fuer den selektierten IoT Hub angelegt werden.

# DeletedDevice
source: A device with this name exists already for this IoT Hub. Do you want to overwrite the device?
de_de: Ein Geraet mit diesem Namen existiert bereits auf diesem IoT Hub. Wollen Sie das Geraet ersaezten?

# DeployFailed
source: Deploying IoT Edge Container modules failed.
de_de: Das Anlegen der IoT Edge Container Module ist fehlgeschlagen.

# Deployment
source: Deploying IoT Edge Containers specified in Deployment Script...
de_de: Lege IoT Edge Container, die im Deployment Script angegeben sind, an...

# GatheringIoTHubs
source: Collecting IoT Hubs You have Access to...
de_de: Sammle IoT Hubs, auf die Sie Zugang haben...

# Install
source: Installing new IoT Edge and Moby Docker instance...
de_de: Installiere eine neue IoT Edge und Moby Docker Instanz...

# InstallFailed
source: Installing IoT Edge runtime failed. Please reboot and try again.
de_de: Die Installation der IoT Edge Laufzeitumgebung ist fehlgeschlagen. Bitte starten Sie den Computer neu und probieren es noch einmal.

source: Installing...
de_de: Installiere...

# IoTEdgeModules
source: Status of IoT Edge Modules:
de_de: Status der IoT Edge Module:

# IoTHubs
source: Pick an IoT Hub:
de_de: Suchen Sie einen IoT Hub aus:

# LoginFailedAlertMessage
source: Unable to login to Azure.
de_de: Das Einloggen in Azure hat nicht geklappt.

# NewAzureDevice
source: Install Azure IoT Edge on this Computer
de_de: Azure IoT Edge auf diesem Computer installieren

# Nic
source: Pick a local network interface for IoT Edge:
de_de: Suchen Sie eine lokale Netwerkschnittstelle aus, die IoT Edge verwenden soll:

# Prerequisits
source: Checking Prerequisits...
de_de: Ueberpruefe Vorrausetzungen zur Installation...

# PreRequisitsFailed
source: Prerequisits to install IoT Edge not yet met. Please try again after all prerequests are met.
de_de: Die Vorraussetzungen zur IoT Edge installation sind noch nicht gegeben. Bitte probieren Sie die Installation erneut, sobald diese gegeben sind.

# Reboot
source: Please restart Windows to complete the installation.
de_de: Bitte starten Sie Windows neu, um die Installation abzuschliessen.

# Uninstall
source: Uninstalling previous IoT Edge instance, if required...
de_de: Vorige Installationen von IoT Edge werden jetzt entfernt, falls erforderlich...

# UninstallFailed
source: Uninstalling IoT Edge runtime failed.
de_de: Das Deinstallieren von der IoT Edge Laufzeitumgebung ist fehlgeschlagen.

# VSwitchExists
source: Aborting setup of HyperV Virtual Switch 'host' as it already exists.
de_de: Das Anlegen der HyperV virtuellen Switch 'host' wird abgebrochen da sie bereits existiert.

# VSwitchSetupFailed
source: Setting up HyperV Virtual Switch 'host' failed.
de_de: Das Anlegen der HyperV virtuellen Switch 'host' ist fehlgeschlagen.

# EnterToExist
source: Press Enter to exit.
de_de: Druecken Sie Enter, um das Program zu verlassen.

# OSNotSupported
source: This Operating System is unfortunately not supported.
de_de: Dieses Betriebssystem wird leider nicht unterstuezt.

# InstallIIoT
source: Additionally install Industrial IoT modules
de_de: Zusaetzlich die Industrial IoT Module installieren

# UseHostname
source: Simply press Enter to use the host name
de_de: Einfach Enter druecken, um den Hostnamen zu nutzen
